---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectShape
source: html/fd331ea8-38a7-67c2-a7c8-40d10418c3f3.htm
---
# DirectShape Methods

Adds the externally tagged geometry object to the DirectShape.